4ms/metamodule/firmware/lib/cmsis-device/stm32mp2xx/Source/Templates/gcc/startup_stm32mp21xx_a35.c
/*******************************************************************************
 * @file    startup_stm32mp2xx_a35.c
 * @author  C.ICORD (Intropack Team)
 * @version $VERSION$
 * @date    $DATE$
 * @brief   CMSIS Cortex-A35 Device Peripheral Access Layer
 *          A35 Aarch32 Start-up source file
 *
 *   This file :
 *      - maps parameters for EL3 monitor, when it launches current Aarch32
 *        application at EL1 (including AMP/SMP mode and security state)
 *      - sets up initial PC to "Reset Handler"
 *      - manages A35_0/A35_1 or A35_1/A35_0 as master/slave cores
 *      - puts slave core in "Wait for interrupt" state
 *      - gets Exception level by testing PE state
 *      - configures cores according to Exception level (EL3 vs EL1)
 *      - sets up Exception vectors
 *      - sets up stacks for all exception modes
 *      - configures IRQ table
 *      - sets caches and MMU configuration at EL1 (only)
 *      - enables NEON and FPU
 *******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2022 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *******************************************************************************
 */
#include "stm32mp2xx.h"
#include "system_stm32mp2xx.h"

/*----------------------------------------------------------------------------
  Definitions
 *----------------------------------------------------------------------------*/
#define USR_MODE 0x10            /* User mode */
#define FIQ_MODE 0x11            /* Fast Interrupt Request mode */
#define IRQ_MODE 0x12            /* Interrupt Request mode */
#define SVC_MODE 0x13            /* Supervisor mode */
#define MON_MODE 0x16            /* Monitor mode */
#define ABT_MODE 0x17            /* Abort mode */
#define UND_MODE 0x1B            /* Undefined Instruction mode */
#define SYS_MODE 0x1F            /* System mode */

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
#if !defined(AARCH_32_Enable)
void EL3_EL1_Interface (void) __attribute__ ((naked, section("RESET")));
void Vectors           (void) __attribute__ ((naked, section("RESET")));
void Reset_Handler     (void) __attribute__ ((naked, section("RESET")));
#else
void Vectors           (void) __attribute__ ((naked, section("RESET")));
void Reset_Handler     (void) __attribute__ ((naked, target("arm")));
#endif

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
void Undef_Handler (void) __attribute__ ((weak, alias("Default_Undef_Handler")));
void SVC_Handler   (void) __attribute__ ((weak, alias("Default_SVC_Handler")));
void PAbt_Handler  (void) __attribute__ ((weak, alias("Default_PAbt_Handler")));
void DAbt_Handler  (void) __attribute__ ((weak, alias("Default_DAbt_Handler")));
void Rsvd_Handler  (void) __attribute__ ((weak, alias("Default_Rsvd_Handler")));
void IRQ_Handler   (void) __attribute__ ((weak, alias("Default_IRQ_Handler")));
void FIQ_Handler   (void) __attribute__ ((weak, alias("Default_FIQ_Handler")));

/*----------------------------------------------------------------------------
  SoC External Interrupt Handlers
 *----------------------------------------------------------------------------*/
/* Interrupt handler for non-allocated interrupts */
void RESERVED_IRQHandler(void) __attribute__ ((weak, alias("Default_ITHandler")));
/* Interrupt handlers for SGI interrupts */
void SGI0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SGI15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
/* IRQ handlers for PPI interrupts */
void HypervisorTimer_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void VirtualTimer_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void Legacy_nFIQ_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SecurePhysicalTimer_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void NonSecurePhysicalTimer_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void Legacy_nIRQ_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
/* IRQ handlers for SPI interrupts */
void PVD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PVM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IWDG1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IWDG2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IWDG3_RST_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IWDG2_RST_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IWDG4_RST_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IWDG5_RST_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void WWDG1_RST_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void WWDG2_RST_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TAMP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RTC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TAMP_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RTC_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RCC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI2_15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_Channel15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_Channel15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_Channel15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPDMA_Channel0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPDMA_Channel1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPDMA_Channel2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPDMA_Channel3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ICACHE_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DCACHE_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ADC1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ADC2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ADC3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN_CAL_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN1_IT0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN2_IT0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN3_IT0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN1_IT1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN2_IT1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FDCAN3_IT1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM1_BRK_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM1_UP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM1_TRG_COM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM1_CC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM20_BRK_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM20_UP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM20_TRG_COM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM20_CC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I3C1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I3C2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USART1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USART2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USART3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void VDEC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM8_BRK_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM8_UP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM8_TRG_COM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM8_CC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void FMC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SDMMC1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UART4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UART5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETH1_SBD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETH1_PMT_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETH1_LPI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETH2_SBD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETH2_PMT_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETH2_LPI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USART6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I3C3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USBH_EHCI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USBH_OHCI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DCMI_PSSI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CSI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DSI_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CRYP1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HASH1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PKA_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UART7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UART8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UART9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPUART1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPI8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SAI1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LTDC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LTDC_ER_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LTDC_SEC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LTDC_SEC_ER_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SAI2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void OCTOSPI1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void OCTOSPI2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void OTFDEC1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPTIM1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void VENC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USBH_WAKEUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SPDIFRX_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC1_RX_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC1_TX_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC1_RX_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC1_TX_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC2_RX_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC2_TX_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC2_RX_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IPCC2_TX_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SAES_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CRYP2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void OTG_WAKEUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void GPU_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void MDF1_FLT7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SAI3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM16_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM17_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SDMMC2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DCMIPP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HSEM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HSEM_S_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CPU2_SYSRESETQ_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
