4ms/metamodule/firmware/lib/cmsis-device/stm32mp2xx/Source/Templates/gcc/startup_stm32mp21xx_a35.c
/*----------------------------------------------------------------------------
  Interrupt Handlers Table :
  WARNING ! "_IRQHandler" name suffix is inherited from MCU products (used in MCU HAL)
            THIS DOESN'T MEAN THAT ALL INTERRUPTS ARE ROUTED THROUGH IRQ LINE
            BETWEEN GIC400 AND CPU !
            (see SystemInit() implementation for design details about interrupts
             management through IRQ and FIQ lines)
 *----------------------------------------------------------------------------*/
IRQHandler_t Interrupt_Handlers_Table[MAX_IRQ_n] = {
   /* Software Generated Interrupts */
   SGI0_IRQHandler,                    /* 0 */
   SGI1_IRQHandler,
   SGI2_IRQHandler,
   SGI3_IRQHandler,
   SGI4_IRQHandler,
   SGI5_IRQHandler,
   SGI6_IRQHandler,
   SGI7_IRQHandler,
   SGI8_IRQHandler,
   SGI9_IRQHandler,
   SGI10_IRQHandler,                   /* 10 */
   SGI11_IRQHandler,
   SGI12_IRQHandler,
   SGI13_IRQHandler,
   SGI14_IRQHandler,
   SGI15_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,                /* 20 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   /* Private Peripheral Interrupts */
   RESERVED_IRQHandler,                /* 25 */
   HypervisorTimer_IRQHandler,
   VirtualTimer_IRQHandler,
   RESERVED_IRQHandler,
   SecurePhysicalTimer_IRQHandler,
   NonSecurePhysicalTimer_IRQHandler,  /* 30 */
   RESERVED_IRQHandler,
   /******  STM32 specific Interrupt Numbers **************************************/
   /* External interrupts according to                                            */
   /* "Table 234. STM32MP25xx interrupt mapping for Cortex-A35"                   */
   /* in chapitre 32 "interrupt list" of reference document                       */
   /* RM0457 - Reference Manual - STM32MP25xx - advanced ARM-based 32/64-bit MPUs */
   /* file "DM00485804 (RM0457) Rev0.2.pdf" (Revision 0.2 / 27-Jul-2021)          */
   /*******************************************************************************/
   PVD_IRQHandler,
   PVM_IRQHandler,
   IWDG1_IRQHandler,
   IWDG2_IRQHandler,                   /* 35 */
   IWDG3_RST_IRQHandler,
   IWDG2_RST_IRQHandler,
   IWDG4_RST_IRQHandler,
   RESERVED_IRQHandler, 
   RESERVED_IRQHandler,                /* 40 */
   WWDG1_RST_IRQHandler,
   TAMP_IRQHandler,
   RTC_IRQHandler,                     
   TAMP_S_IRQHandler,
   RTC_S_IRQHandler,                   /* 45 */
   RCC_IRQHandler,
   EXTI2_0_IRQHandler,
   EXTI2_1_IRQHandler,                 
   EXTI2_2_IRQHandler,
   EXTI2_3_IRQHandler,                /* 50 */
   EXTI2_4_IRQHandler,
   EXTI2_5_IRQHandler,
   EXTI2_6_IRQHandler,                 
   EXTI2_7_IRQHandler,
   EXTI2_8_IRQHandler,                /* 55 */
   EXTI2_9_IRQHandler,
   EXTI2_10_IRQHandler,
   EXTI2_11_IRQHandler,                
   EXTI2_12_IRQHandler,
   EXTI2_13_IRQHandler,                /* 60 */
   EXTI2_14_IRQHandler,
   EXTI2_15_IRQHandler,
   HPDMA1_Channel0_IRQHandler,         
   HPDMA1_Channel1_IRQHandler,
   HPDMA1_Channel2_IRQHandler,         /* 65 */
   HPDMA1_Channel3_IRQHandler,
   HPDMA1_Channel4_IRQHandler,
   HPDMA1_Channel5_IRQHandler,         
   HPDMA1_Channel6_IRQHandler,
   HPDMA1_Channel7_IRQHandler,        /* 70 */
   HPDMA1_Channel8_IRQHandler,
   HPDMA1_Channel9_IRQHandler,
   HPDMA1_Channel10_IRQHandler,       
   HPDMA1_Channel11_IRQHandler,
   HPDMA1_Channel12_IRQHandler,        /* 75 */
   HPDMA1_Channel13_IRQHandler,
   HPDMA1_Channel14_IRQHandler,
   HPDMA1_Channel15_IRQHandler,        
   HPDMA2_Channel0_IRQHandler,
   HPDMA2_Channel1_IRQHandler,         /* 80 */
   HPDMA2_Channel2_IRQHandler,
   HPDMA2_Channel3_IRQHandler,
   HPDMA2_Channel4_IRQHandler,         
   HPDMA2_Channel5_IRQHandler,
   HPDMA2_Channel6_IRQHandler,         /* 85 */
   HPDMA2_Channel7_IRQHandler,
   HPDMA2_Channel8_IRQHandler,
   HPDMA2_Channel9_IRQHandler,        
   HPDMA2_Channel10_IRQHandler,
   HPDMA2_Channel11_IRQHandler,        /* 90 */
   HPDMA2_Channel12_IRQHandler,
   HPDMA2_Channel13_IRQHandler,
   HPDMA2_Channel14_IRQHandler,        
   HPDMA2_Channel15_IRQHandler,
   HPDMA3_Channel0_IRQHandler,         /* 95 */
   HPDMA3_Channel1_IRQHandler,
   HPDMA3_Channel2_IRQHandler,
   HPDMA3_Channel3_IRQHandler,        
   HPDMA3_Channel4_IRQHandler,
   HPDMA3_Channel5_IRQHandler,        /* 100 */
   HPDMA3_Channel6_IRQHandler,
   HPDMA3_Channel7_IRQHandler,
   HPDMA3_Channel8_IRQHandler,        
   HPDMA3_Channel9_IRQHandler,
   HPDMA3_Channel10_IRQHandler,       /* 105 */
   HPDMA3_Channel11_IRQHandler,
   HPDMA3_Channel12_IRQHandler,
   HPDMA3_Channel13_IRQHandler,       
   HPDMA3_Channel14_IRQHandler,
   HPDMA3_Channel15_IRQHandler,      /* 110 */
   ICACHE_IRQHandler,
   DCACHE_IRQHandler,
   ADC1_IRQHandler,                  
   ADC2_IRQHandler,                   
   FDCAN_CAL_IRQHandler,             /* 115 */
   FDCAN1_IT0_IRQHandler,
   FDCAN2_IT0_IRQHandler,
   FDCAN1_IT1_IRQHandler,            
   FDCAN2_IT1_IRQHandler,
   TIM1_BRK_IRQHandler,              /* 120 */
   TIM1_UP_IRQHandler,               
   TIM1_TRG_COM_IRQHandler,
   TIM1_CC_IRQHandler,
   TIM2_IRQHandler,
   TIM3_IRQHandler,                 /* 125 */
   TIM4_IRQHandler,
   I2C1_IRQHandler,                   
   I3C1_IRQHandler,
   I2C2_IRQHandler,
   I3C2_IRQHandler,                 /* 130 */
   SPI1_IRQHandler,
   SPI2_IRQHandler,                  
   USART1_IRQHandler,
   USART2_IRQHandler,
   USART3_IRQHandler,               /* 135 */
   RESERVED_IRQHandler,
   TIM8_BRK_IRQHandler,               
   TIM8_UP_IRQHandler,
   TIM8_TRG_COM_IRQHandler,
   TIM8_CC_IRQHandler,              /* 140 */
   FMC_IRQHandler,
   SDMMC1_IRQHandler,                 
   TIM5_IRQHandler,
   SPI3_IRQHandler,
   UART4_IRQHandler,               /* 145 */
   UART5_IRQHandler,
   TIM6_IRQHandler,                   
   TIM7_IRQHandler,
   ETH1_SBD_IRQHandler,
   ETH1_PMT_IRQHandler,           /* 150 */
   ETH1_LPI_IRQHandler,
   ETH2_SBD_IRQHandler,              
   ETH2_PMT_IRQHandler,
   ETH2_LPI_IRQHandler,
   USART6_IRQHandler,            /* 155 */
   I2C3_IRQHandler,
   I3C3_IRQHandler,                  
   USBH_EHCI_IRQHandler,
   USBH_OHCI_IRQHandler,
   DCMI_PSSI_IRQHandler,          /* 160 */
   CSI_IRQHandler,
   RESERVED_IRQHandler,
   CRYP1_IRQHandler,
   HASH1_IRQHandler,
   PKA_IRQHandler,               /* 165 */
   RESERVED_IRQHandler,
   UART7_IRQHandler,                  
   LPUART1_IRQHandler,
   SPI4_IRQHandler,
   SPI5_IRQHandler,             /* 170 */
   SPI6_IRQHandler,
   SAI1_IRQHandler,
   LTDC_IRQHandler,                  
   LTDC_ER_IRQHandler,
   LTDC_SEC_IRQHandler,         /* 175 */
   LTDC_SEC_ER_IRQHandler,
   SAI2_IRQHandler,
   OCTOSPI1_IRQHandler,               
   RESERVED_IRQHandler,
   OTFDEC1_IRQHandler,         /* 180 */
   LPTIM1_IRQHandler,
   USBH_WAKEUP_IRQHandler,
   SPDIFRX_IRQHandler,
   IPCC1_RX_IRQHandler,
   IPCC1_TX_IRQHandler,       /* 185 */
   IPCC1_RX_S_IRQHandler,             
   IPCC1_TX_S_IRQHandler,           
   SAES_IRQHandler,
   CRYP2_IRQHandler,
   OTG_WAKEUP_IRQHandler,         /* 190 */
   RESERVED_IRQHandler,                 
   MDF1_FLT0_IRQHandler,
   MDF1_FLT1_IRQHandler,
   MDF1_FLT2_IRQHandler,
   MDF1_FLT3_IRQHandler,        /* 195 */
   SAI3_IRQHandler,
   TIM15_IRQHandler,                  
   TIM16_IRQHandler,
   TIM17_IRQHandler,
   TIM12_IRQHandler,           /* 200 */
   SDMMC2_IRQHandler,
   DCMIPP_IRQHandler,                 
   RESERVED_IRQHandler,
   CPU2_SYSRESETQ_IRQHandler,
   TIM13_IRQHandler,            /* 205 */                
   TIM14_IRQHandler,
   TIM10_IRQHandler,
   RNG1_IRQHandler,
   RESERVED_IRQHandler,
   HASH2_IRQHandler,            /* 210 */
   SDMMC3_IRQHandler,
   LPTIM2_IRQHandler,
   LPTIM3_IRQHandler,
   LPTIM4_IRQHandler,
   LPTIM5_IRQHandler,           /* 215 */      
   RESERVED_IRQHandler,
   CPU2_SEV_IRQHandler,
   RCC_WAKEUP_IRQHandler,
   SAI4_IRQHandler,                   
   DTS_IRQHandler,             /* 220 */
   TIM11_IRQHandler,
   CPU1_WAKEUP_PIN_IRQHandler,
   OTG_IRQHandler,
   RNG2_IRQHandler,
   RESERVED_IRQHandler,      /* 225 */
   CCB_IRQHandler,
   SERF_IRQHandler,
   BUSPERFM_IRQHandler,
   RAMCFG_IRQHandler,
   DDRCTRL_IRQHandler,             /* 230 */  
   DDRPHYC_IRQHandler,
   DFI_ERR_IRQHandler,
   IAC_IRQHandler,
   VDDCPU_VD_IRQHandler,
   VDDCORE_VD_IRQHandler,           /* 235 */
   RETRAMCRC_ERR_IRQHandler,
   HPDMA1_WKUP_IRQHandler,           
   HPDMA2_WKUP_IRQHandler,
   HPDMA3_WKUP_IRQHandler,
   DBG_AUTH_HOST_IRQHandler,        /* 240 */
   DBG_AUTH_ACK_IRQHandler,           
   RCC_HSI_FMON_IRQHandler,
   RCC_MSI_FMON_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,            /* 245 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,          /* 250 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,       /* 255 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 260 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,    /* 265 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 270 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 275 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 280 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,     /* 285 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 290 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,       /* 295 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   EXTI1_0_IRQHandler,         /* 300 */  
   EXTI1_1_IRQHandler,
   EXTI1_2_IRQHandler,
   EXTI1_3_IRQHandler,
   EXTI1_4_IRQHandler,
   EXTI1_5_IRQHandler,        /* 305 */     
   EXTI1_6_IRQHandler,          
   EXTI1_7_IRQHandler,
   EXTI1_8_IRQHandler,
   EXTI1_9_IRQHandler,
   EXTI1_10_IRQHandler,         /* 310 */               
   EXTI1_11_IRQHandler,
   EXTI1_12_IRQHandler,
   EXTI1_13_IRQHandler,
   EXTI1_14_IRQHandler,
   EXTI1_15_IRQHandler,              /* 315 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,               /* 320 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,              /* 325 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,              /* 330 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,              /* 335 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,                 /* 340 */
   L2WERR_IRQHandler,
   DDRPERFM_IRQHandler,
   RESERVED_IRQHandler,
   PMSTAT0_IRQHandler,
   PMSTAT1_IRQHandler,                /* 345 */
   PMSTAT2_IRQHandler,
   PMSTAT3_IRQHandler,
   PMSTAT4_IRQHandler,
   PMSTAT5_IRQHandler,
   PMSTAT6_IRQHandler,            /* 350 */        
   PMSTAT7_IRQHandler,         
   PMSTAT8_IRQHandler,
   PMSTAT9_IRQHandler,
   PMSTAT10_IRQHandler,
   PMSTAT11_IRQHandler,            /* 355 */  
   PMSTAT12_IRQHandler,         
   PMSTAT13_IRQHandler,
   PMSTAT14_IRQHandler,
   PMSTAT15_IRQHandler,
   PMSTAT16_IRQHandler,           /* 360 */    
   RESERVED_IRQHandler,         
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,           /* 365 */
   RESERVED_IRQHandler,        
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,            /* 370 */
   RESERVED_IRQHandler,      
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,           /* 375 */
   RESERVED_IRQHandler,       
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,            /* 380 */      
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 385 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      /* 390 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,       /* 395 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   PMUIRQ0_IRQHandler,        /* 400 */               
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,      
   RESERVED_IRQHandler,
   COMMRX0_IRQHandler,
   RESERVED_IRQHandler,       /* 405 */               
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   COMMTX0_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,             /* 410 */   
   RESERVED_IRQHandler,
   nCTIIRQ0_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler               /* 415 */ 
};

